<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #11 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347735191","plan_hash":"1d5cdf9ef1b80392ac6134ccbb31d0137a6568ba05b1dfb703ce28b00de6e7f3","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 5 to add, 3 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster will be updated in-place
!~  resource "aws_ecs_cluster" "fastapi-cluster" {
        id       = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
        name     = "fastapi-cluster"
!~      tags     = {
-           "Environment" = "Prod Environment" -> null
        }
!~      tags_all = {
!~          "Environment" = "Prod Environment" -> "Dev Environment"
        }
#        (1 unchanged attribute hidden)

#        (1 unchanged block hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:11" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:11" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:c3f28675e8fc6ca54d7f0e468af2270ab082ced2" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:d8653a6c06efff693b2444dda2ef42b79c8475aa"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 11 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_lb_listener.front_end will be destroyed
  # (because aws_lb_listener.front_end is not in configuration)
-   resource "aws_lb_listener" "front_end" {
-       arn               = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/a39eb394fa73d92e" -> null
-       id                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/a39eb394fa73d92e" -> null
-       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0" -> null
-       port              = 80 -> null
-       protocol          = "HTTP" -> null
-       tags              = {} -> null
-       tags_all          = {
-           "Environment" = "Dev Environment"
        } -> null

-       default_action {
-           order            = 1 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
-           type             = "forward" -> null
        }
    }

  # aws_lb_listener.listerner_443 will be created
+   resource "aws_lb_listener" "listerner_443" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_listener.listerner_80 will be created
+   resource "aws_lb_listener" "listerner_80" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03"
+           type             = "forward"
        }
    }

  # aws_lb_listener_certificate.example will be created
+   resource "aws_lb_listener_certificate" "example" {
+       certificate_arn = "arn:aws:acm:us-east-1:806066816337:certificate/3848def8-0982-4f7e-b2be-664c6d00d101"
+       id              = (known after apply)
+       listener_arn    = (known after apply)
    }

  # aws_lb_target_group.target_group_P-5001 will be created
+   resource "aws_lb_target_group" "target_group_P-5001" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "alb-target-group-dev"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTPS"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"
    }

  # aws_security_group.internet_to_ALB will be updated in-place
!~  resource "aws_security_group" "internet_to_ALB" {
        id                     = "sg-052ce8f0ae0d6fabe"
!~      ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Inbound from Internet to ALB"
+               from_port        = 443
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
#            (1 unchanged element hidden)
        ]
        name                   = "internet-to-alb-dev"
        tags                   = {}
#        (7 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 2 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #11](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347735191)